{
    "food-ordering-system": {
        "name": "Food Ordering System",
        "language": "JavaScript, HTML, CSS",
        "time": "Sep 2021 - Dec 2021",
        "demoURL": "https://frances-food-ordering.herokuapp.com",
        "githubURL": "https://github.com/FrancesF6/FoodOrderingSystem",
        "description":
        "In the food ordering system, a user who has logged in can place a new order from a selected restaurant. After the order has successfully placed, the user can rate it. They can also browse the profile and order history of any other user whose profile is set to public.<br>An admin of the system can browse the list of restaurants, add a new restaurant, modify any existing restaurant's basic information or menu, and can also view the sales statistics of all restaurants, such as their most popular dishes.",
        "details":
        "The project originated from several assignments in the course \"Fundamental of Web Applications\". The assignments' requirements include developing a webpage which allows a user to browse menus for several restaurants, add or remove items and place an order; developing a server capable of tracking sales data for each restaurant, providing functionalities to allow a user to add a new restaurant, modify a restaurant's basic information, add new categories or dishes. They also require support for sessions so that the users can log in, log out, change their privacy settings. The session data, user data and order data should be stored in a local database.<br><br>Besides the assignment requirements, I have added some other features, such as:<ul class='list'><li>Setting three user groups: guest, user and admin. Guests can only browse the user list, users can place new orders, administrators can browse the restaurant list, modify the restaurants, and add new restaurants.</li><li>Setting admin's privileges so that an admin can not only modify the basic information of the restaurant, add new dishes, but can also set whether the restaurant is visible to users, modify or delete any dish in the menu.</li><li>Adding a rating system, so that users can rate their own orders. The server will display the average star rating of each restaurant on the user order page and the restaurant list page.</li><li>Adding some front-end and back-end validations, such as verifying user password security, verifying basic restaurant information, and verifying restaurant menu to ensure the formatting of the menu in the database.</li></ul>",
        "demoPics": [
            {
                "title": "register page",
                "src": "/proj-demo-pics/FOS-register.png"
            },
            {
                "title": "user profile page",
                "src": "/proj-demo-pics/FOS-user-page.png"
            },
            {
                "title": "order page",
                "src": "/proj-demo-pics/FOS-order-page.png"
            },
            {
                "title": "place a new order",
                "src": "/proj-demo-pics/FOS-place-new-order.png"
            },
            {
                "title": "system admin can modify the restaurant",
                "src": "/proj-demo-pics/FOS-admin-modify-a-restaurant.png"
            },
            {
                "title": "system admin can browse list of restaurants",
                "src": "/proj-demo-pics/FOS-admin-restaurants.png"
            },
            {
                "title": "system admin can check the sales stats",
                "src": "/proj-demo-pics/FOS-admin-sales-stats.png"
            }
        ]
    },
    "encryption-decryption": {
        "name": "Encryption Decryption (Under construction)",
        "language": "C",
        "time": "Sep 2021 - ",
        "demoURL": "",
        "githubURL": "",
        "description": "",
        "details": "",
        "demoPics": []
    }
}